{
  "schema_version": "1.0",
  "product_id": "8116738687033",
  "source": "shopify",
  "source_url": "https://goodfair1.myshopify.com",
  "handle": "100-authentic-african-black-soap-paste-deep-cleansing-skin-detox",
  "title": "100% Authentic African Black Soap Paste – Deep Cleansing & Skin Detox",
  "vendor": "Duma Mbili LLC",
  "product_type": "Facial Cleansers",
  "description": "<p>Our Traditional African Black Soaps is hand made in Ghana with natural<span class=\"Apple-converted-space\">  </span>traditional recipe, Organic Black Soap it is free from artificial ingredients, chemicals, preservatives, color enhancers and fragrances. African traditional black soap is one of the most beneficial yet unheard of soaps you will ever find, this miracle soap is an all natural cleansing soap, and a prime example of the beauty of indigenous Ghanaian knowledge. This is due to the abundance of minerals, antioxidants and vitamins it contains. It is a rich and moisturizing all-purpose soap that can cleanse and rejuvenate your skin, body and hair, ideal to use on sensitive, oily, dry and problematic skin. It is renowned for revealing healthy and radiant skin as well as acting as a makeup remover due to its deep cleaning properties. Best African Black Soap for Acne and Hyperpigmentation</p>\n<p><strong><span class=\"OYPEnA text-decoration-none text-strikethrough-none\">Who should use it:</span></strong></p>\n<p><span class=\"OYPEnA text-decoration-none text-strikethrough-none\">In general, African black soap can be used by all skin types but could irritate dry or sensitive skin. How often can you use it; Can be used daily but may need to slowly incorporate into a routine. Works well with Sunscreen and moisturizers containing humectants, emollients, and occlusives</span></p>\n<p><b>Ingredients</b>:</p>\n<p>Roasted Cocoa Pods, Plantain Skin ash, Shea Butter, <span>Purified </span>Water.</p>\n<p><strong>Storage:</strong> Normal shelf life is 24 months. To prolong the shelf life of the our African black soap, keep it in a cool and dry area.</p>\n<p>After using your black soap in the shower you can then store it in an air-tight container or zip-lock bag in a cooler and drier section of the house. </p>\n<p><strong><span>Benefits of African Black Soap:</span></strong></p>\n<p><strong>Deep Cleansing:</strong> Removes dirt and impurities for clean, refreshed skin.<br><strong>Natural Ingredients:</strong> Made from plant-based ingredients like roasted cocoa pods, plantain skin ash, and shea butter.<br><strong>Moisturizing:</strong> Shea butter helps keep skin soft and hydrated.<br><strong>Versatile Use:</strong> Suitable for face, body, and hair.<br><strong>Exfoliation:</strong> Gently removes dead skin cells for a smoother texture.<br><strong>Gentle on Skin:</strong> Ideal for sensitive, oily, and combination skin types.<br><strong>Makeup Removal</strong>: Effectively removes makeup.<br><strong>Eco-Friendly:</strong> Made with natural, sustainable ingredients.<br><strong>Supports Tradition: </strong>Supports traditional craftsmanship and communities in Ghana.</p>\n<p><strong>How to use</strong>: As with any natural products, we always recommend a patch test 48 hours before use. If irritation occurs, please discontinue use.</p>\n<p>Either cut a small part of the soap or rub your hands or sponge/scrub on the soap lather with water and enjoy your shower. The soaps lather extremely well so a little will go a very long way.<span class=\"Apple-converted-space\"> </span></p>\n<p>For some individuals Raw African soap can be drying. It is best to follow up with a good moisturizer such as Raw African Shea Butter. Please avoid contact with eyes. </p>\n<p><strong>DO NOT</strong> rub or apply the soap directly on the skin and face. This soap may contain small particles of plantains that could scratch or cause irritation. Lather soap in washcloth, sponge, or loofah and apply to face, body, or hair.</p>",
  "pricing": {
    "currency": "INR",
    "min_price": 17.99,
    "max_price": 17.99
  },
  "variants": [
    {
      "variant_id": "45249830813753",
      "title": "8 oz",
      "price": 17.99,
      "available": false,
      "sku": "ABSPASTE-02"
    }
  ],
  "images": [
    {
      "url": "https://cdn.shopify.com/s/files/1/0077/1745/3881/files/0006935_west-african-black-soap-paste-16-oz_1920.jpg?v=1765909604",
      "alt_text": null
    }
  ],
  "availability": {
    "in_stock": false,
    "total_variants": 1,
    "available_variants": 0
  },
  "metadata": {
    "created_at": "2025-12-12T13:05:42-05:00",
    "ingested_at": "2026-01-30T12:29:15.403999+00:00"
  }
}