{
  "schema_version": "1.0",
  "product_id": "8117468987449",
  "source": "shopify",
  "source_url": "https://goodfair1.myshopify.com",
  "handle": "comforter-storage-bags",
  "title": "Comforter Storage Bags",
  "vendor": "Organic Cotton Mart",
  "product_type": "",
  "description": "<ul>\n<li>Made from durable 100% cotton canvas material</li>\n<li>Easy 2-way zipper closure</li>\n<li>2 handles to easily carry</li>\n<li>Breathable fabric</li>\n<li>Perfect to store comforters, blankets, sheets, and clothes</li>\n</ul>\n<!-- split -->\n<p>Features</p>\n<!-- split -->\n<p><strong>Multipurpose Canvas Storage Bags With Handles - </strong> Have trouble finding storage space for your precious duvets, blankets, and other bedding? Our heavy-duty canvas storage bags are perfect for all your storage needs. You can not only store comforters, blankets, and bed sheets but also clothes or repurpose the bags to hold anything of your choice, like tools, art materials, camping gear, or other valuables</p>\n<p><strong>Functional &amp; Breathable Design - </strong> Featuring a convenient two-way zip opening, making it easy to put in or take out items from the bag, our canvas bag with zipper has sturdy double stitched handles to make carrying easier by distributing the weight equally. These canvas storage bags are breathable and will allow efficient air circulation, preventing any musty odors or mold growth</p>\n<p><strong>Eco-Friendly, Safe and Durable Materials - </strong> Our canvas under-bed storage bags are crafted from the finest quality, high-grade canvas material that is extremely durable, tear-resistant, and sure to last you for many years to come. Free from any harmful substances, these canvas quilt storage bags don't contain any artificial dyes, bleach, or anything that could affect you, and are incredibly skin-friendly</p>\n<p><strong>Versatile Size for All your Valuables - </strong> Measuring 26\"L x 20\"W x 11.5\"H, these natural canvas storage bags are the perfect size for storing one king-size or queen-size duvet, blanket, or other bulky bedding, keeping them safe and in pristine condition. This canvas storage bag for bedding comes as a set of 1, 2 or 3 bags and is sure to be cost-effective and value for money for all your storage needs</p>\n<p><strong>Perfect Gift for Everyone - </strong> Are you looking for a practical yet thoughtful and elegant gift? These extra-large canvas storage bags make a wonderful gift to your family, friends, colleagues, and loved ones for every festive and non-festive occasion, such as birthdays, anniversaries, Mother's Day, housewarming parties, Christmas, Halloween, Thanksgiving, New Year, and more</p>\n<!-- split -->\n<p>More Information</p>\n<!-- split -->\n<h2><strong>Storage Bags for Blankets</strong></h2>\n<p>Say goodbye to clutter and disorganization with Organic Cotton Mart 100% Eco-Friendly Canvas Storage Bags. They're not only functional but also a responsible choice for the environment. With these storage bags with handles, you can enjoy hassle-free organization and dust-free storage without compromising on quality. Elevate your organization game with our premium Canvas Storage Bags – a duo designed for eco-conscious homemakers.</p>\n<p>With the perfect blend of functionality and aesthetics, these canvas storage bags will not only cover all your storage needs but will also add a touch of elegance to your home. Unlike other storage bags canvas bags are a lot more breathable, help air circulation, and prevent the buildup of musty odors to keep your valuables crisp and smelling fresh always.</p>\n<p>Safeguard your linens, sheets, and other precious items from dust and the daily impact of the elements with this canvas storage bag that is dust-proof and will protect your garments from collecting cobwebs or dust.</p>\n<p>Made from 100% eco-friendly canvas that is of the highest quality, our bags are sure to last long and will not tear or rip easily giving you a reliable option for storage. With dimensions perfect for king and queen-sized bedding, these bags offer you a hassle-free storage solution and can also store items of your choice like art materials, books, camping gear, etc</p>\n<p>All our products are manufactured using durable &amp; safe materials in facilities adhering to strict compliance and stringent quality standards.</p>",
  "pricing": {
    "currency": "INR",
    "min_price": 24.99,
    "max_price": 49.99
  },
  "variants": [
    {
      "variant_id": "45251512696889",
      "title": "1 Bag",
      "price": 24.99,
      "available": true,
      "sku": "CAN-STR-BAG-01"
    },
    {
      "variant_id": "45251512729657",
      "title": "2 Bags",
      "price": 39.99,
      "available": true,
      "sku": "CAN-STR-BAG-02"
    },
    {
      "variant_id": "45251512762425",
      "title": "3 Bags",
      "price": 49.99,
      "available": true,
      "sku": "CAN-STR-BAG-03"
    }
  ],
  "images": [
    {
      "url": "https://cdn.shopify.com/s/files/1/0077/1745/3881/files/comforter-storage-bags.jpg?v=1765646387",
      "alt_text": null
    },
    {
      "url": "https://cdn.shopify.com/s/files/1/0077/1745/3881/files/blanket-storage-bags-with-handle.jpg?v=1765646387",
      "alt_text": null
    },
    {
      "url": "https://cdn.shopify.com/s/files/1/0077/1745/3881/files/under-bed-canvas-storage-bags-dimensions-new.png?v=1765646388",
      "alt_text": null
    },
    {
      "url": "https://cdn.shopify.com/s/files/1/0077/1745/3881/files/zippered-extra-large-storage-bags.jpg?v=1765646388",
      "alt_text": null
    },
    {
      "url": "https://cdn.shopify.com/s/files/1/0077/1745/3881/files/zippered-large-canvas-storage-bags.jpg?v=1765646387",
      "alt_text": null
    },
    {
      "url": "https://cdn.shopify.com/s/files/1/0077/1745/3881/files/heavy-duty-canvas-fabric-bags.jpg?v=1765646388",
      "alt_text": null
    },
    {
      "url": "https://cdn.shopify.com/s/files/1/0077/1745/3881/files/closet-storage-bags-duvets.jpg?v=1765646387",
      "alt_text": null
    }
  ],
  "availability": {
    "in_stock": true,
    "total_variants": 3,
    "available_variants": 3
  },
  "metadata": {
    "created_at": "2025-12-13T12:19:45-05:00",
    "ingested_at": "2026-01-30T12:29:15.439187+00:00"
  }
}