{
  "schema_version": "1.0",
  "product_id": "8117511716921",
  "source": "shopify",
  "source_url": "https://goodfair1.myshopify.com",
  "handle": "court-caddy-pickleball-bag",
  "title": "Court Caddy Pickleball Bag",
  "vendor": "FORWRD",
  "product_type": "Pickleball Bag, Pickleball Backpack",
  "description": "<h1 data-pm-slice=\"1 1 []\">FORWRD Court Caddy: The Best Pickleball Bag You’ll Ever Own — Trusted by Over 4,000+ Players &amp; counting</h1>\n<p>You’ve probably had a “pretty good” pickleball bag before. But pretty good doesn’t cut it when your paddles cost $200, you play three times a week, and your gear’s tossed into a saggy backpack that can’t stand up on its own. The Court Caddy is designed with a sleek, modular structure to separate it from less engineered pickleball bags. The idea for the Court Caddy came from noticing the shortcomings of existing options and a desire to create something better for pickleball players.</p>\n<p><strong>That’s why FORWRD built the Court Caddy</strong>—not to be good, but to be the <strong>best pickleball bag</strong> on the market. Period. The modular design and Rapid Grab Pickleball System make organizing gear more fun and engaging. The bag is made from premium materials, including <meta charset=\"utf-8\"><strong>Poly Carbonate Coated </strong><meta charset=\"utf-8\"><strong>840D Ballistic Nylon, and a heavy duty</strong> <strong>TPU-coated nylon boot</strong>, which are ultra long lasting and tear resistant, ensuring the bag stands up to frequent use. The bag's bottom is crafted from rugged material, allowing it to be placed directly on the ground without damage and providing extra durability and protection. Its compact design holds all your gear efficiently without being bulky, and the ideal dimensions balance capacity and portability. The Court Caddy features a dedicated pocket for keys, ensuring organization and convenience. The bag has been put to the test by over 3,000 players, proving its durability and functionality. Investing in the Court Caddy can help save money in the long run by avoiding frequent replacements. The bag excels at maintaining its appearance and structure over time, even with regular use.</p>\n<h2>Introduction: Why the Right Pickleball Bag Matters</h2>\n<p>Every pickleball player knows that the right gear can make or break your game—and that starts with the perfect pickleball bag. Whether you’re heading to a tournament or just hitting the local courts, your bag needs to do more than just carry your paddles. It should accommodate all your essentials, from pickleball paddles and balls to water bottles, towels, and extra layers. A well-designed pickleball bag like the Court Caddy is built to withstand rough court surfaces, keeping your gear protected and organized no matter where you play. With a focus on durability, comfort, and smart storage, the right bag ensures you spend less time fumbling for equipment and more time enjoying the game. The Court Caddy Pickleball Bag is engineered to carry everything you need, so you can focus on your performance and have confidence that your gear is always ready for action.</p>\n<h2>What Sets It Apart (And Why 4,000+ Players Have Already Bought It)</h2>\n<p>Our features are designed specifically for pickleball players, ensuring every detail meets your needs on and off the court.</p>\n<ul>\n<li>\n<p><strong>4 Paddle Capacity:</strong> Structured compartment protects all your paddles. No rubbing grips. No dead zones.</p>\n</li>\n<li>\n<p><strong>Holds 8 Balls (With Rapid Grab™ Pockets):</strong> Access balls instantly—no zippers, no digging.</p>\n</li>\n<li>\n<p><strong>Dual Water Bottle Pockets:</strong> Each holds up to 40oz bottles.</p>\n</li>\n<li>\n<p><strong>Padded Laptop Sleeve:</strong> Holds laptops up to 15” for court-to-office players and coaches.</p>\n</li>\n<li>\n<p><strong>Magnetic Modular System:</strong> Add or remove a Shoe Cube, Eyewear Case, or Paddle Sleeve as needed. The modular system makes organizing your gear more fun and efficient.</p>\n</li>\n<li>\n<p><strong>Rigid Upright Design:</strong> TPU-coated base and structured frame ensure it stands tall, even half full. The bag's bottom material is designed to protect the bag when placed on the ground, offering extra durability and practicality for outdoor play.</p>\n</li>\n<li>\n<p><strong>Hidden Fence Hooks &amp; Anti-Theft Storage:</strong> Includes a dedicated pocket for keys, plus towel ring, key leash, and fleece-lined pocket for valuables, ensuring secure and convenient storage of your personal items.</p>\n</li>\n<li>\n<p><strong>Compact Size &amp; Ideal Dimensions:</strong> The bag's compact design and ideal dimensions allow it to hold all your gear efficiently without being bulky, making it easy to carry while maximizing storage.</p>\n</li>\n<li>\n<p><strong>Built Like Luggage, Not a Gym Bag:</strong> PU-coated ballistic nylon, AquaGuard YKK zippers, reinforced stitching. Uses ultra long lasting and tear resistant fabrics for maximum durability.</p>\n</li>\n<li>\n<p><strong>Spill-Proof Zipper Pocket:</strong> Protects your items from leaks.</p>\n</li>\n<li>\n<p><strong>Durability:</strong> Engineered to withstand frequent use while maintaining the bag's appearance and structure over time.</p>\n</li>\n<li>\n<p><strong>Tested by Pickleball Players:</strong> This bag has been put to the test by thousands of pickleball players, ensuring it meets real-world demands.</p>\n</li>\n<li>\n<p><strong>Save Money:</strong> The bag helps you save by lasting longer than typical options, reducing the need for frequent replacements.</p>\n</li>\n</ul>\n<h2>Real Reviews. Real Results.</h2>\n<blockquote>\n<p><em>“This is hands down the best pickleball bag I’ve owned. Thoughtfully built, premium quality, and holds everything without being bulky.”</em>– Mark L., Verified Buyer</p>\n</blockquote>\n<blockquote>\n<p><em>“Looks sharp, stands upright, fits all my gear and still has space left. Absolutely worth the price.”</em>– Amanda C., 5-Star Review</p>\n</blockquote>\n<p>With over <strong>200 five-star reviews</strong> and <strong>3,000+ bags sold</strong>, the Court Caddy is the go-to choice for players who demand quality, structure, and smart design. The bag has been put to the test by real pickleball players, who have praised its durability and thoughtful design. It has received a lifetime warranty covering functional defects, including broken zippers and seams.</p>\n<h2>Why It’s the Best Pickleball Bag for You</h2>\n<ul>\n<li>\n<p>You’re tired of digging through a floppy, disorganized gym bag and want a compact option with ideal dimensions that makes it easy for pickleball players to carry all their gear efficiently.</p>\n</li>\n<li>\n<p>You want one bag that works for both work and the court, with a bag's bottom that’s durable enough to be placed on the ground without worry, and modular features that make organizing your gear fun and engaging.</p>\n</li>\n<li>\n<p>You want something you’ll be proud to carry—one that has been put to the test by serious pickleball players, is ultra long lasting, tear resistant, and maintains its quality and appearance over time, even with frequent use. This helps you save money by avoiding frequent replacements.</p>\n</li>\n</ul>\n<h2>Who It’s Built For</h2>\n<ul>\n<li>\n<p><strong>Pickleball players</strong> seeking a bag designed specifically for their needs</p>\n</li>\n<li>\n<p><strong>Tournament players</strong>, especially those who play at the forward court position and need quick access to their gear, carrying multiple paddles, gear, and extras</p>\n</li>\n<li>\n<p><strong>Working professionals</strong> who head straight to the courts</p>\n</li>\n<li>\n<p><strong>Rec players</strong> looking for one long-term solution</p>\n</li>\n<li>\n<p><strong>Coaches and parents</strong> who carry gear for others</p>\n</li>\n</ul>\n<h2>Specs at a Glance</h2>\n<ul>\n<li>\n<p><strong>Dimensions:</strong> 8” D × 12” W × 20” H — the bag's ideal dimensions offer a compact profile while still accommodating all your pickleball gear.</p>\n</li>\n<li>\n<p><strong>Capacity:</strong> 30 liters — spacious yet compact, designed for pickleball players who need efficient storage without bulk.</p>\n</li>\n<li>\n<p><strong>Weight:</strong> 4–5 lbs (dry weight: 4 lbs)</p>\n</li>\n<li>\n<p><strong>Colors:</strong> Black, Gray, Green</p>\n</li>\n<li>\n<p><strong>Price:</strong> $325 — save money over time with a bag built to last longer than typical options.</p>\n</li>\n<li>\n<p><strong>Warranty:</strong> Lifetime Guarantee — constructed with ultra long lasting, tear resistant materials, maintaining quality and appearance even with frequent use.</p>\n</li>\n<li>\n<p><strong>Materials:</strong> The bag's bottom is reinforced for durability when placed on the ground, protecting your gear on any surface.</p>\n</li>\n<li>\n<p><strong>Features:</strong> Includes a dedicated pocket for keys and valuables, plus compartments designed for pickleball players' needs.</p>\n</li>\n<li>\n<p><strong>Quality Assurance:</strong> This bag has been put to the test by real pickleball players to ensure it meets the demands of regular play.</p>\n</li>\n<li>\n<p><strong>Shipping:</strong> Fast from Provo, Utah</p>\n</li>\n</ul>\n<h2>Accessories and Add-Ons: Elevate Your Game</h2>\n<p>Take your pickleball experience to the next level with the Court Caddy Pickleball Bag’s innovative accessories and add-ons. The Paddle Sleeve offers a secure, magnetic pull-tab pocket that keeps your paddles protected and easily accessible—no more digging around or worrying about scratches. For those who like to bring an extra pair of shoes, the Shoe Cube provides dedicated storage for even the largest sizes, keeping your footwear separate from the rest of your gear. And for players who never hit the court without their shades, the Magnetic Eyewear Case is a game-changer: it features a soft felt interior, premium YKK zippers, and a handy carabiner hook for easy attachment. All these accessories are designed to seamlessly integrate with your Court Caddy Pickleball Bag using mini G-hooks or magnetic points, so you can customize your setup to fit your needs. With these smart add-ons, you’ll have a bag that’s as versatile and dynamic as your game.</p>\n<h2>Protective Cases: Keep Your Gear Safe</h2>\n<p>Your pickleball gear deserves the best protection, and the Court Caddy Pickleball Bag delivers with premium, ultra-durable materials. Crafted from<strong> </strong>Poly Carbonate Coated <meta charset=\"utf-8\">840D Ballistic Nylon, and a heavy duty textured TPU-coated nylon boot, this bag is both scratch resistant and water resistant, ensuring your equipment stays safe from the elements and rough court surfaces. The ultra tear proof hypalon zipper pull tabs are non slip and built to last, so you never have to worry about your bag popping open or zippers breaking mid-season. Inside, a padded laptop sleeve keeps your device secure, while dedicated paddle slots and ball pockets provide organized, cushioned storage for all your essentials. With the Court Caddy, you get peace of mind knowing your paddles, laptop, and other valuables are protected by the best materials and thoughtful design in the game.</p>\n<h2>Comparing Bags: How Does It Stack Up?</h2>\n<p>When it comes to pickleball bags, not all are created equal. The Court Caddy Pickleball Bag stands out from most pickleball bags with its incredibly sleek, streamlined profile and ideal bag dimensions—offering ample room for all your gear without being overly bulky. Its lightweight material makes it easy to carry, while the Spandura lined back panel and shoulder straps provide unmatched comfort and durability, using the best material found in athletic wear. Unlike other bags that sag or lose shape, the Court Caddy maintains its structure and looks sharp on and off the court. Plus, it features zippers from the longest lasting zipper brand, so you never have to worry about broken zippers or stuck pulls. If you’re looking for a pickleball backpack that combines premium materials, functional design, and a universal size that fits every player’s needs, the Court Caddy is the clear winner.</p>\n<h2>Frequently Asked Questions</h2>\n<ol>\n<li>\n<p><strong>What is the warranty on the Court Caddy Pickleball Bag? </strong>The Court Caddy Pickleball Bag is backed by FORWRD’s Manufacturer’s Lifetime Warranty, covering manufacturing defects such as broken zippers, torn zipper tracks, broken buttons, and seam or seal issues. Your investment is protected for the long haul.</p>\n</li>\n<li>\n<p><strong>Can I return the bag if I’m not satisfied? </strong>Absolutely. Returns are accepted within 30 days of purchase with proper return authorization. Please note that customers are responsible for return shipping charges.</p>\n</li>\n<li>\n<p><strong>Is the bag waterproof? </strong>The Court Caddy Pickleball Bag is made with water resistant, textured TPU coated nylon to keep your gear dry and protected, even in unpredictable weather.</p>\n</li>\n<li>\n<p><strong>Can I attach accessories to the bag? </strong>Yes! The Court Caddy features an integrated Mollie loop system and magnetic points, allowing you to easily attach accessories like the Paddle Sleeve, Shoe Cube, and Magnetic Eyewear Case for a fully customized setup.</p>\n</li>\n<li>\n<p><strong>Is the bag suitable for daily use? </strong>Definitely. Designed for daily use, the Court Caddy Pickleball Bag uses premium <meta charset=\"utf-8\">Poly Carbonate Coated <meta charset=\"utf-8\">840D Ballistic Nylon, and textured TPU-coated nylon boot to withstand rough court surfaces and maintain its shape, making it the perfect companion for both the court and everyday life.</p>\n</li>\n</ol>\n<h2>Bottom Line?</h2>\n<p>If you’re looking for the <strong>best pickleball bag</strong>—the one that solves all the problems others create—this is it. Built by players. Backed for life. Proven by 3,000+ satisfied customers.</p>\n<p><a rel=\"noopener noreferrer\" href=\"https://forwrd.co/products/court-caddy-pickleball-bag\" target=\"_blank\"><strong>Order your Court Caddy now</strong></a> and never look back.</p>",
  "pricing": {
    "currency": "INR",
    "min_price": 325.0,
    "max_price": 325.0
  },
  "variants": [
    {
      "variant_id": "45251622109241",
      "title": "Black (Backorder - Ships April 2026)",
      "price": 325.0,
      "available": true,
      "sku": "FORWRD-COURT-CADDY-BLK"
    },
    {
      "variant_id": "45251622142009",
      "title": "Slate Gray",
      "price": 325.0,
      "available": true,
      "sku": "COURT-CADDY-GRAY"
    },
    {
      "variant_id": "45251622174777",
      "title": "Wasatch Green",
      "price": 325.0,
      "available": true,
      "sku": "COURT-CADDY-GREEN"
    },
    {
      "variant_id": "45251622207545",
      "title": "Bone White",
      "price": 325.0,
      "available": true,
      "sku": "COURT-CADDY-BONE-WHITE"
    },
    {
      "variant_id": "45251622240313",
      "title": "Nordic Blue",
      "price": 325.0,
      "available": true,
      "sku": "COURT-CADDY-BLUE"
    }
  ],
  "images": [
    {
      "url": "https://cdn.shopify.com/s/files/1/0077/1745/3881/files/black_caddy_main_main.png?v=1765905981",
      "alt_text": null
    },
    {
      "url": "https://cdn.shopify.com/s/files/1/0077/1745/3881/files/black_caddy_main.png?v=1765650807",
      "alt_text": null
    },
    {
      "url": "https://cdn.shopify.com/s/files/1/0077/1745/3881/files/f66615b2-9322-4e6c-bb11-d873dc74909e.jpg?v=1765650808",
      "alt_text": null
    },
    {
      "url": "https://cdn.shopify.com/s/files/1/0077/1745/3881/files/Screenshot_2025-11-25_at_3.34.37_PM.png?v=1765650808",
      "alt_text": null
    },
    {
      "url": "https://cdn.shopify.com/s/files/1/0077/1745/3881/files/Sleeve-insert-demo.jpg?v=1765650807",
      "alt_text": null
    },
    {
      "url": "https://cdn.shopify.com/s/files/1/0077/1745/3881/files/CC-ball-pocket-BLK.jpg?v=1765650807",
      "alt_text": null
    },
    {
      "url": "https://cdn.shopify.com/s/files/1/0077/1745/3881/files/CC-010-BLK.jpg?v=1765650807",
      "alt_text": null
    },
    {
      "url": "https://cdn.shopify.com/s/files/1/0077/1745/3881/files/DSC09334-black.jpg?v=1765650807",
      "alt_text": null
    },
    {
      "url": "https://cdn.shopify.com/s/files/1/0077/1745/3881/files/court-caddy-pickleball-bag-438501.jpg?v=1765650807",
      "alt_text": null
    },
    {
      "url": "https://cdn.shopify.com/s/files/1/0077/1745/3881/files/surface_safe_base.png?v=1765650808",
      "alt_text": null
    },
    {
      "url": "https://cdn.shopify.com/s/files/1/0077/1745/3881/files/court-caddy-pickleball-bag-593569.png?v=1765650808",
      "alt_text": null
    },
    {
      "url": "https://cdn.shopify.com/s/files/1/0077/1745/3881/files/court-caddy-shoe-cube-885489.jpg?v=1765650809",
      "alt_text": null
    },
    {
      "url": "https://cdn.shopify.com/s/files/1/0077/1745/3881/files/BLK3.png?v=1765650808",
      "alt_text": null
    },
    {
      "url": "https://cdn.shopify.com/s/files/1/0077/1745/3881/files/BLK1.png?v=1765650808",
      "alt_text": null
    },
    {
      "url": "https://cdn.shopify.com/s/files/1/0077/1745/3881/files/BLK2.png?v=1765650807",
      "alt_text": null
    },
    {
      "url": "https://cdn.shopify.com/s/files/1/0077/1745/3881/files/BLK_6.png?v=1765650808",
      "alt_text": null
    },
    {
      "url": "https://cdn.shopify.com/s/files/1/0077/1745/3881/files/BLK6.png?v=1765650808",
      "alt_text": null
    },
    {
      "url": "https://cdn.shopify.com/s/files/1/0077/1745/3881/files/BLK9.png?v=1765650808",
      "alt_text": null
    },
    {
      "url": "https://cdn.shopify.com/s/files/1/0077/1745/3881/files/gray_caddy_main.png?v=1765650808",
      "alt_text": null
    },
    {
      "url": "https://cdn.shopify.com/s/files/1/0077/1745/3881/files/Gray_Main.png?v=1765650808",
      "alt_text": null
    },
    {
      "url": "https://cdn.shopify.com/s/files/1/0077/1745/3881/files/Gray_5.png?v=1765650808",
      "alt_text": null
    },
    {
      "url": "https://cdn.shopify.com/s/files/1/0077/1745/3881/files/Gray_2.png?v=1765650808",
      "alt_text": null
    },
    {
      "url": "https://cdn.shopify.com/s/files/1/0077/1745/3881/files/gray_3.png?v=1765650808",
      "alt_text": null
    },
    {
      "url": "https://cdn.shopify.com/s/files/1/0077/1745/3881/files/A6701386-Edit-2_0a3c2d12-6640-458a-a7a0-6a6c133f2ac3.jpg?v=1765650807",
      "alt_text": null
    },
    {
      "url": "https://cdn.shopify.com/s/files/1/0077/1745/3881/files/gray6.png?v=1765650809",
      "alt_text": null
    },
    {
      "url": "https://cdn.shopify.com/s/files/1/0077/1745/3881/files/es-it-easy-to-pick-up-and-carry-the-bag-short-distances-adding-an-extra-element-of-convenience-Dual-Hypalon-Towel-Rings-A-dedicated-ring-for-towels-provides-a-secure-and-easily-access.png?v=1765650808",
      "alt_text": null
    },
    {
      "url": "https://cdn.shopify.com/s/files/1/0077/1745/3881/files/es-it-easy-to-pick-up-and-carry-the-bag-short-distances-adding-an-extra-element-of-convenience-Dual-Hypalon-Towel-Rings-A-dedicated-ring-for-towels-provides-a-secure-and-easily-access_e3d5b8be-0077-456d-bff5-9c48a69849e7.png?v=1765650808",
      "alt_text": null
    },
    {
      "url": "https://cdn.shopify.com/s/files/1/0077/1745/3881/files/es-it-easy-to-pick-up-and-carry-the-bag-short-distances-adding-an-extra-element-of-convenience-Dual-Hypalon-Towel-Rings-A-dedicated-ring-for-towels-provides-a-secure-and-easily-access.jpg?v=1765650807",
      "alt_text": null
    },
    {
      "url": "https://cdn.shopify.com/s/files/1/0077/1745/3881/files/Green_caddy_main.png?v=1765650808",
      "alt_text": null
    },
    {
      "url": "https://cdn.shopify.com/s/files/1/0077/1745/3881/files/A6701124-Edit.jpg?v=1765650808",
      "alt_text": null
    },
    {
      "url": "https://cdn.shopify.com/s/files/1/0077/1745/3881/files/A6701120-Edit.jpg?v=1765650807",
      "alt_text": null
    },
    {
      "url": "https://cdn.shopify.com/s/files/1/0077/1745/3881/files/Court-caddy-right-angled.jpg?v=1765650807",
      "alt_text": null
    },
    {
      "url": "https://cdn.shopify.com/s/files/1/0077/1745/3881/files/blue_caddy_main.png?v=1765650808",
      "alt_text": null
    },
    {
      "url": "https://cdn.shopify.com/s/files/1/0077/1745/3881/files/A67016535.jpg?v=1765650807",
      "alt_text": null
    },
    {
      "url": "https://cdn.shopify.com/s/files/1/0077/1745/3881/files/A6701288.jpg?v=1765650810",
      "alt_text": null
    },
    {
      "url": "https://cdn.shopify.com/s/files/1/0077/1745/3881/files/A6701284.jpg?v=1765650809",
      "alt_text": null
    },
    {
      "url": "https://cdn.shopify.com/s/files/1/0077/1745/3881/files/A6701297.jpg?v=1765650809",
      "alt_text": null
    },
    {
      "url": "https://cdn.shopify.com/s/files/1/0077/1745/3881/files/A6701301.jpg?v=1765650809",
      "alt_text": null
    },
    {
      "url": "https://cdn.shopify.com/s/files/1/0077/1745/3881/files/A67016534.jpg?v=1765650807",
      "alt_text": null
    },
    {
      "url": "https://cdn.shopify.com/s/files/1/0077/1745/3881/files/A6701653.jpg?v=1765650808",
      "alt_text": null
    },
    {
      "url": "https://cdn.shopify.com/s/files/1/0077/1745/3881/files/nordic-blue-court-caddy-paddle-sleeve-with-paddle-and-ball-front-left-angle.jpg?v=1765650808",
      "alt_text": null
    },
    {
      "url": "https://cdn.shopify.com/s/files/1/0077/1745/3881/files/Bone_8.png?v=1765650808",
      "alt_text": null
    },
    {
      "url": "https://cdn.shopify.com/s/files/1/0077/1745/3881/files/Bone_5.png?v=1765650807",
      "alt_text": null
    },
    {
      "url": "https://cdn.shopify.com/s/files/1/0077/1745/3881/files/Bone_6.png?v=1765650808",
      "alt_text": null
    },
    {
      "url": "https://cdn.shopify.com/s/files/1/0077/1745/3881/files/Bone_Caddy_Main.png?v=1765650809",
      "alt_text": null
    }
  ],
  "availability": {
    "in_stock": true,
    "total_variants": 5,
    "available_variants": 5
  },
  "metadata": {
    "created_at": "2025-12-13T13:33:24-05:00",
    "ingested_at": "2026-01-30T12:29:15.443793+00:00"
  }
}